:PROPERTIES:
:ID:       259e67ca-539b-4877-ae9e-86240da54321
:END:
#+TITLE: Disk Setup: LUKS For Guix, Vyos, Etc
#+CATEGORY: slips
#+TAGS:

*** sfdisk

$ sfdisk -lJ vyos-1.5-rolling-202501171533-generic-amd64.iso

#+name: sfdiskJson
#+begin_example json
{
  "partitiontable": {
    "label": "dos",
    "id": "0x4cd96b11",
    "device": "/mnt/usb/boot/isos/vyos-1.5-rolling-202501171533-generic-amd64.iso",
    "unit": "sectors",
    "sectorsize": 512,
    "partitions": [{
      "node": "/mnt/usb/boot/isos/vyos-1.5-rolling-202501171533-generic-amd64.iso1",
       "start": 64,
       "size": 1155008,
       "type": "0",
       "bootable": true
     },{
       "node": "/mnt/usb/boot/isos/vyos-1.5-rolling-202501171533-generic-amd64.iso2",
       "start": 540,
       "size": 9536,
       "type": "ef"
     }]
  }
}
#+end_example

#+name: sf2dmsetupTable
#+begin_src jq :cmd-line "-r" :stdin sfdiskJson
.partitiontable.partitions
| map(. | "\(.start) \(.size) linear /dev/loop\(.index.dammitJq) 0")
| join(",")
| "dontloopmebro,,,ro,\(.)"
| @text
#+end_src

#+RESULTS: sf2dmsetupTable
: dontloopmebro,,,ro,64 1155008 linear /dev/loopnull 0,540 9536 linear /dev/loopnull 0

piping this to a =#!/bin/jq= script should fairly easily produce output for
=dmsetup=... though it doesn't include uuids.

#+begin_quote
note: i checked =jc= but it doesn't have a dmsetup parser

I'm not sure if the above jq output is correct for dmsetup. It's been awhile
#+end_quote

